Documents/СменныйРапортСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СменныйРапортСклада</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееКоличествоЗаявок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦелоеНеотрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСменыСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтаршийСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Грузчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прогул</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаЗаВес</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штраф</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бригадирские</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кладовщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прогул</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоплатаЗаВес</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штраф</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бригадирские</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СменныйРапортСклада/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбраьртчикиСобытий

&НаКлиенте
Процедура ВидСменыПриИзменении(элемент)
	
	Если ПредопределенноеЗначение("Перечисление.ВидСменыСклада.ДневнаяСмена") = Объект.ВидСмены Тогда
		Объект.ВремяНачалаРаботы = "00010101080000";
		Объект.ВремяОкончанияРаботы = "00010101200000";
	Иначе
		Объект.ВремяОкончанияРаботы = "00010101080000";
		Объект.ВремяНачалаРаботы = "00010101200000";
	КонецЕсли;
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиПриОкончанииРедактирования(элемент, новаяСтрока, отменаРедактирования)
	
	Если отменаРедактирования Тогда
		Возврат;			
	КонецЕсли;
	
	Если новаяСтрока Тогда
		ПересчетТабличнойЧастиНаСервере(элемент.Имя);
	Иначе
		ОбработатьДанныеСтрокПриИзменении(Элементы.Грузчики.ТекущиеДанные, элемент.Имя);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГрузчикиПослеУдаления(элемент)
	ПересчетТабличнойЧастиНаСервере(элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиПриОкончанииРедактирования(элемент, новаяСтрока, отменаРедактирования)
	
	Если отменаРедактирования Тогда
		Возврат;			
	КонецЕсли;
	
	Если новаяСтрока Тогда
		ПересчетТабличнойЧастиНаСервере(элемент.Имя);
	Иначе
		ОбработатьДанныеСтрокПриИзменении(Элементы.Кладовщики.ТекущиеДанные, элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КладовщикиПослеУдаления(элемент)
	ПересчетТабличнойЧастиНаСервере(элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбщийВесПриИзменении(элемент)
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПересчетТабличнойЧастиНаСервере("Грузчики");
	ПересчетТабличнойЧастиНаСервере("Кладовщики");
	
КонецПроцедуры


#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура ПересчетТабличнойЧастиНаСервере(имяТабличнойЧасти)
	
	ДокументСменныйРапортСкладаСервер.ПересчетТабличнойЧастиДокумента(Объект, имяТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеСтрокПриИзменении(данныеСтрок, имяТабличнойЧасти)
	
	ОбработатьДанныеСтрокПриИзмененииНаСервере(ОбработкаТабличныхЧастейКлиентСервер.ПолучитьИдентификаторыСтрок(данныеСтрок), Новый Структура("ИмяТабличнойЧасти",имяТабличнойЧасти));

КонецПроцедуры // ОбработатьДанныеСтрокПриИзменении()

&НаСервере
Процедура ОбработатьДанныеСтрокПриИзмененииНаСервере(Знач идентификаторыСтрок, Знач дополнительныеСвойства)

	дополнительныеСвойства.Вставить("Объект",Объект);
	
	ДокументСменныйРапортСкладаСервер.ОбработатьДанныеСтрокПриИзменении(идентификаторыСтрок, дополнительныеСвойства);

КонецПроцедуры // ОбработатьДанныеСтрокПриИзмененииНаСервере()

#КонецОбласти
